CRUD-general-purpose/2024/ranking-ycsb_11-2024_mongodb-ce-800-large-large-aws_0_gxD4m3UU/0_load.txt
bin/ycsb load mongodb -s -jvm-args=-XX:MaxRAMPercentage=85.0  -p mongodb.url=mongodb://benchant:Performance99@172.31.20.67:27017,172.31.20.102:27017,172.31.30.91:27017/admin?maxPoolSize=200 -p batchsize=10 -p workload=site.ycsb.workloads.CoreWorkload -threads 200 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -p insertstart=0  -p hdrhistogram.percentiles=50,90,95,99,99.99,99.99999 
/usr/lib/jvm/java-1.8.0-openjdk-amd64/bin/java -XX:MaxRAMPercentage=85.0 -cp /binary/ycsb/mongodb-binding/conf:/binary/ycsb/conf:/binary/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/binary/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/binary/ycsb/lib/core-0.18.0-SNAPSHOT.jar:/binary/ycsb/lib/jackson-core-asl-1.9.4.jar:/binary/ycsb/lib/HdrHistogram-2.1.4.jar:/binary/ycsb/mongodb-binding/lib/mongodb-binding-0.18.0-SNAPSHOT.jar:/binary/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/binary/ycsb/mongodb-binding/lib/bson-record-codec-5.1.3.jar:/binary/ycsb/mongodb-binding/lib/bson-5.1.3.jar:/binary/ycsb/mongodb-binding/lib/mongodb-driver-sync-5.1.3.jar:/binary/ycsb/mongodb-binding/lib/mongodb-driver-core-5.1.3.jar:/binary/ycsb/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/binary/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/binary/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/binary/ycsb/mongodb-binding/lib/slf4j-api-1.7.25.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -p mongodb.url=mongodb://benchant:Performance99@172.31.20.67:27017,172.31.20.102:27017,172.31.30.91:27017/admin?maxPoolSize=200 -p batchsize=10 -p workload=site.ycsb.workloads.CoreWorkload -threads 200 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -p insertstart=0 -p hdrhistogram.percentiles=50,90,95,99,99.99,99.99999 -load
Command line: -db site.ycsb.db.MongoDbClient -s -p mongodb.url=mongodb://benchant:Performance99@172.31.20.67:27017,172.31.20.102:27017,172.31.30.91:27017/admin?maxPoolSize=200 -p batchsize=10 -p workload=site.ycsb.workloads.CoreWorkload -threads 200 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -p insertstart=0 -p hdrhistogram.percentiles=50,90,95,99,99.99,99.99999 -load
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
Starting test.
2024-11-25 09:06:44:258 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://benchant:Performance99@172.31.20.67:27017,172.31.20.102:27017,172.31.30.91:27017/admin?maxPoolSize=200
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-11-25 09:06:54:244 10 sec: 855490 operations; 85540.45 current ops/sec; est completion in 49 seconds [INSERT: Count=855510, Max=477695, Min=1, Avg=2269.43, 90=6191, 99=28767, 99.9=76671, 99.99=316415] 
2024-11-25 09:07:04:244 20 sec: 1809920 operations; 95452.55 current ops/sec; est completion in 36 seconds [INSERT: Count=954410, Max=48927, Min=1, Avg=2093.96, 90=4723, 99=26847, 99.9=33215, 99.99=42879] 
2024-11-25 09:07:14:244 30 sec: 2154470 operations; 34455 current ops/sec; est completion in 40 seconds [INSERT: Count=344550, Max=221311, Min=1, Avg=5751.74, 90=2965, 99=149631, 99.9=194559, 99.99=204543] 
2024-11-25 09:07:24:244 40 sec: 2292420 operations; 13795 current ops/sec; est completion in 48 seconds [INSERT: Count=137950, Max=294655, Min=1, Avg=14490.3, 90=3355, 99=174079, 99.9=281599, 99.99=287231] 
2024-11-25 09:07:34:244 50 sec: 2932780 operations; 64036 current ops/sec; est completion in 36 seconds [INSERT: Count=640360, Max=215423, Min=1, Avg=3147.47, 90=5951, 99=51711, 99.9=158335, 99.99=208255] 
2024-11-25 09:07:44:244 60 sec: 3496660 operations; 56388 current ops/sec; est completion in 26 seconds [INSERT: Count=563880, Max=281087, Min=1, Avg=3547.82, 90=5243, 99=53951, 99.9=233727, 99.99=271359] 
2024-11-25 09:07:54:244 70 sec: 4197280 operations; 70062 current ops/sec; est completion in 14 seconds [INSERT: Count=700620, Max=191231, Min=1, Avg=2851.86, 90=5703, 99=30719, 99.9=149887, 99.99=182399] 
2024-11-25 09:08:03:591 79 sec: 5000000 operations; 85870.77 current ops/sec; [CLEANUP: Count=200, Max=9087, Min=0, Avg=45.67, 90=1, 99=6, 99.9=9087, 99.99=9087] [INSERT: Count=802720, Max=81599, Min=1, Avg=2261.15, 90=8279, 99=29007, 99.9=44351, 99.99=65919] 
[OVERALL], RunTime(ms), 79347
[OVERALL], Throughput(ops/sec), 63014.35466999382
[TOTAL_GCS_PS_Scavenge], Count, 151
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 357
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.44992249234375586
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 151
[TOTAL_GC_TIME], Time(ms), 357
[TOTAL_GC_TIME_%], Time(%), 0.44992249234375586
[CLEANUP], Operations, 200
[CLEANUP], AverageLatency(us), 45.675
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 9087
[CLEANUP], 50thPercentileLatency(us), 0
[CLEANUP], 90thPercentileLatency(us), 1
[CLEANUP], 95thPercentileLatency(us), 1
[CLEANUP], 99thPercentileLatency(us), 6
[CLEANUP], 99.99PercentileLatency(us), 9087
[CLEANUP], 99.99999PercentileLatency(us), 9087
[INSERT], Operations, 5000000
[INSERT], AverageLatency(us), 3149.9846744
[INSERT], MinLatency(us), 1
[INSERT], MaxLatency(us), 477695
[INSERT], 50thPercentileLatency(us), 2
[INSERT], 90thPercentileLatency(us), 7103
[INSERT], 95thPercentileLatency(us), 21935
[INSERT], 99thPercentileLatency(us), 37183
[INSERT], 99.99PercentileLatency(us), 267263
[INSERT], 99.99999PercentileLatency(us), 477695
[INSERT], Return=OK, 500000
[INSERT], Return=BATCHED_OK, 4500000